[
  {
    "id": 1,
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "isbn": "9780061120084",
    "publicationYear": 1960,
    "genre": "Fiction",
    "isRead": false,
    "completed": false,
    "wishlist": true,
    "owned": false,
    "image": "https://covers.openlibrary.org/b/isbn/9780061120084-L.jpg",
    "description": "Set in the Deep South, this novel follows young Scout Finch as her father, Atticus, defends a black man falsely accused of a crime. Through Scout's eyes, the story explores themes of racial injustice, moral growth, and compassion. The small town of Maycomb is vividly depicted, with its prejudices and traditions. Harper Lee's classic is a profound commentary on humanity and empathy. The narrative blends innocence with the harsh realities of society. It remains a powerful tale of courage and conscience.",
    "deleted": false
  },
  {
    "id": 2,
    "title": "1984",
    "author": "George Orwell",
    "completed": false,
    "isbn": "9780451524935",
    "publicationYear": 1949,
    "genre": "Dystopian",
    "isRead": true,
    "wishlist": false,
    "owned": true,
    "image": "https://covers.openlibrary.org/b/isbn/9780451524935-L.jpg",
    "description": "1984 presents a chilling vision of a totalitarian regime where Big Brother watches every move. Winston Smith, the protagonist, struggles with oppression and seeks truth in a world of propaganda. The novel explores themes of surveillance, individuality, and freedom. Orwell's dystopia warns of the dangers of unchecked power. The story is both a political commentary and a psychological exploration. Its impact on culture and language endures to this day.",
    "deleted": false
  },
  {
    "id": 3,
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "isbn": "9780743273565",
    "publicationYear": 1925,
    "genre": "Classic",
    "isRead": false,
    "completed": false,
    "wishlist": false,
    "owned": false,
    "image": "https://covers.openlibrary.org/b/isbn/9780743273565-L.jpg",
    "description": "The Great Gatsby captures the glamour and disillusionment of the Jazz Age. Jay Gatsby, a mysterious millionaire, throws lavish parties in hopes of winning back his lost love, Daisy Buchanan. Narrated by Nick Carraway, the novel explores themes of wealth, love, and the American Dream. Fitzgerald's prose paints a vivid picture of 1920s society. The story is both romantic and tragic. It remains a timeless critique of ambition and excess.",
    "deleted": false
  },
  {
    "id": 4,
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "isbn": "9780141439518",
    "publicationYear": 1813,
    "genre": "Romance",
    "isRead": false,
    "completed": false,
    "wishlist": true,
    "owned": false,
    "image": "https://covers.openlibrary.org/b/isbn/9780141439518-L.jpg",
    "description": "Pride and Prejudice follows the spirited Elizabeth Bennet as she navigates issues of class, marriage, and morality. Her encounters with the proud Mr. Darcy lead to misunderstandings and personal growth. Austen's wit and social commentary shine throughout the novel. The story explores the complexities of relationships and societal expectations. Its memorable characters and sharp dialogue have captivated readers for generations. The novel remains a beloved classic of English literature.",
    "deleted": false
  },
  {
    "id": 5,
    "title": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "isbn": "9780547928227",
    "publicationYear": 1937,
    "genre": "Fantasy",
    "isRead": false,
    "completed": false,
    "wishlist": false,
    "owned": false,
    "image": "https://covers.openlibrary.org/b/isbn/9780547928227-L.jpg",
    "description": "The Hobbit tells the tale of Bilbo Baggins, a reluctant adventurer swept into a quest for treasure. Alongside dwarves and the wizard Gandalf, Bilbo faces trolls, goblins, and a dragon named Smaug. Tolkien's world is rich with magic and wonder. The story explores themes of bravery, friendship, and self-discovery. Its lighthearted tone and imaginative setting have delighted readers of all ages. The novel is a cornerstone of modern fantasy.",
    "deleted": false
  },
  {
    "id": 6,
    "title": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "isbn": "9780316769488",
    "publicationYear": 1951,
    "genre": "Fiction",
    "isRead": false,
    "completed": false,
    "wishlist": false,
    "owned": false,
    "image": "https://covers.openlibrary.org/b/isbn/9780316769488-L.jpg",
    "description": "The Catcher in the Rye follows Holden Caulfield, a disenchanted teenager wandering New York City. Struggling with alienation and loss, Holden seeks meaning in a world he finds phony. Salinger's novel captures the voice of adolescent angst and rebellion. The narrative is both humorous and poignant. Themes of innocence, identity, and belonging resonate throughout. The book remains a defining work of twentieth-century literature.",
    "deleted": false
  },
  {
    "id": 7,
    "title": "Moby-Dick",
    "author": "Herman Melville",
    "isbn": "9781503280786",
    "publicationYear": 1851,
    "genre": "Adventure",
    "isRead": false,
    "completed": false,
    "wishlist": false,
    "owned": false,
    "image": "https://covers.openlibrary.org/b/isbn/9781503280786-L.jpg",
    "description": "Moby-Dick chronicles Captain Ahab's obsessive quest to hunt the elusive white whale. Narrated by Ishmael, the novel delves into themes of fate, obsession, and the human condition. Melville's work blends adventure with philosophical reflection. The story explores the dangers of vengeance and the mysteries of the sea. Its rich symbolism and complex characters have inspired generations. The novel is a monumental achievement in American literature.",
    "deleted": false
  },
  {
    "id": 8,
    "title": "War and Peace",
    "author": "Leo Tolstoy",
    "isbn": "9780199232765",
    "publicationYear": 1869,
    "genre": "Historical",
    "isRead": false,
    "completed": false,
    "wishlist": false,
    "owned": false,
    "image": "https://covers.openlibrary.org/b/isbn/9780199232765-L.jpg",
    "description": "War and Peace is an epic tale set against the backdrop of Napoleonic Russia. It follows the lives of aristocratic families as they navigate love, loss, and war. Tolstoy weaves together personal stories with historical events. The novel explores themes of fate, free will, and the nature of history. Its sweeping narrative and deep character studies are unmatched. The book stands as one of literature's greatest achievements.",
    "deleted": false
  },
  {
    "id": 9,
    "title": "The Alchemist",
    "author": "Paulo Coelho",
    "isbn": "9780061122415",
    "publicationYear": 1988,
    "genre": "Adventure",
    "isRead": false,
    "completed": false,
    "wishlist": false,
    "owned": false,
    "image": "https://covers.openlibrary.org/b/isbn/9780061122415-L.jpg",
    "description": "The Alchemist follows Santiago, a young shepherd, on his journey to find a hidden treasure. Guided by dreams and omens, he learns about destiny and the importance of following one's heart. Coelho's novel is a philosophical fable about self-discovery. The story blends adventure with spiritual wisdom. Its simple prose and universal themes have inspired millions. The book encourages readers to pursue their personal legends.",
    "deleted": false
  },
  {
    "id": 10,
    "title": "Brave New World",
    "author": "Aldous Huxley",
    "isbn": "9780060850524",
    "publicationYear": 1932,
    "genre": "Science Fiction",
    "isRead": false,
    "completed": false,
    "wishlist": false,
    "owned": false,
    "image": "https://covers.openlibrary.org/b/isbn/9780060850524-L.jpg",
    "description": "Brave New World envisions a future society driven by technology and control. Citizens are engineered for conformity and pleasure, but individuality is suppressed. The story follows Bernard Marx and others as they question the cost of utopia. Huxley's novel explores themes of freedom, happiness, and dehumanization. Its prophetic vision remains relevant in modern times. The book is a classic of dystopian literature.",
    "deleted": false
  }
]